Autodesk.Revit.DB.SpatialElementBoundaryLocation
An enumerated type listing boundary options of spatial element geometry calculation.

Autodesk.Revit.DB.SpatialElementBoundaryLocation.CoreCenter
Spatial element core center.

Autodesk.Revit.DB.SpatialElementBoundaryLocation.CoreBoundary
Spatial element core boundary.

Autodesk.Revit.DB.SpatialElementBoundaryLocation.Center
Spatial element centerline.

Autodesk.Revit.DB.SpatialElementBoundaryLocation.Finish
Spatial element finish face.